Функция ПолучитьСтандартЗначения()
	ЗначенияКонст = Новый Структура;
	
	ЗначенияКонст.Вставить("ПравильныйРезультат",		"12 34 56 78");
	ЗначенияКонст.Вставить("НаименованиеГрупп",	"ИС");
	ЗначенияКонст.Вставить("ГодСозданияКом",	2007);
	
	Возврат ЗначенияКонст;
КонецФункции 



Процедура ЗаписатьКонстанту() Экспорт  
	ПравильныйРезультат = ПолучитьСтандартЗначения().ПравильныйРезультат;
	ГодСозданияКом = ПолучитьСтандартЗначения().ГодСозданияКом;
	НаименованиеГрупп = ПолучитьСтандартЗначения().НаименованиеГрупп;
	
	Если Не Константы.ПравильныйРезультат.Получить() = ПравильныйРезультат Тогда
			Константы.ПравильныйРезультат.Установить(ПравильныйРезультат);
			Сообщить("Константа 'ПравильныйРезультат' записана");	                  
		КонецЕсли;  
                                              	
	Если Не Константы.НаименованиеГруппы.Получить() = НаименованиеГрупп Тогда
		Константы.НаименованиеГруппы.Установить(НаименованиеГрупп);
		Сообщить("Константа 'НаименованиеГруппы' записана");	                  
	КонецЕсли;   
	
	Если Не Константы.ГодСозданияКомпетенции.Получить() = ГодСозданияКом Тогда
		Константы.ГодСозданияКомпетенции.Установить(ГодСозданияКом);
		Сообщить("Константа 'ГодСозданияКомпетенции' записана");	                  
	КонецЕсли;         
КонецПроцедуры


Процедура ЗаписатьКонстантуПервыйЗапуск() Экспорт  
	ПравильныйРезультат = ПолучитьСтандартЗначения().ПравильныйРезультат;
	ГодСозданияКом = ПолучитьСтандартЗначения().ГодСозданияКом;
	НаименованиеГрупп = ПолучитьСтандартЗначения().НаименованиеГрупп;
	
	Если Не ЗначениеЗаполнено(Константы.ПравильныйРезультат.Получить()) Тогда
			Константы.ПравильныйРезультат.Установить(ПравильныйРезультат);
			Сообщить("Константа 'ПравильныйРезультат' записана");	                  
		КонецЕсли;  
                                              	
	Если Не ЗначениеЗаполнено(Константы.НаименованиеГруппы.Получить()) Тогда
		Константы.НаименованиеГруппы.Установить(НаименованиеГрупп);
		Сообщить("Константа 'НаименованиеГруппы' записана");	                  
	КонецЕсли;   
	
	Если Не ЗначениеЗаполнено(Константы.ГодСозданияКомпетенции.Получить()) Тогда
		Константы.ГодСозданияКомпетенции.Установить(ГодСозданияКом);
		Сообщить("Константа 'ГодСозданияКомпетенции' записана");	                  
	КонецЕсли;         
КонецПроцедуры
