
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Год =  Число(Год(ТекущаяДата()));
	ЭлементСписка = Элементы.ГодЗачисления.СписокВыбора;
	
	ОбластьЗач = 2;           
	
	ЭлементСписка.Очистить();
	
	Для Сч = -ОбластьЗач По ОбластьЗач Цикл
		ГодЗач = Год + Сч;
		ЭлементСписка.Добавить(СтрЗаменить(Строка(ГодЗач),Символы.НПП,""),СтрЗаменить(Строка(ГодЗач),Символы.НПП,""));	
	КонецЦикла;
	
	ГодЗачисления = СтрЗаменить(Строка(Год-2),Символы.НПП,"");
	
	ЗаполинтьНомерГруппы();               
	
	НаименованиеГруппы = Константы.НаименованиеГруппы.Получить();
	
	ЗаполнитьНаименование();

КонецПроцедуры

Процедура ЗаполинтьНомерГруппы()

	СписокНомеров = Элементы.НомерГруппы.СписокВыбора;
	СписокНомеров.Очистить();
	
	Номер = Строка((((ГодЗачисления)-Константы.ГодСозданияКомпетенции.Получить())+1)%10);
	КолвоГрупп = 9;
	Для Сч = 1 По КолвоГрупп Цикл
	    	НГ = Номер + Строка(Сч);
		СписокНомеров.Добавить(НГ,НГ);					
	КонецЦикла;   	
    	НомерГруппы =  СписокНомеров[0];
КонецПроцедуры



&НаСервере
Процедура СоздатьНаСервере(Наименование)
	ИмпортДанных.СоздатьГруппуСправочник(Наименование); 
	ИмпортДанных.СоздатьГруппуСтудента(Наименование);
КонецПроцедуры


&НаКлиенте
Процедура Создать(Команда)
	Если ЗначениеЗаполнено(ГодЗачисления) Тогда 
		Если  ЗначениеЗаполнено(Наименование) Тогда	
			СоздатьНаСервере(Наименование);	
			ЭтаФорма.Закрыть();
		Иначе		
			Предупреждение("Поле 'Наименование' пустое");		
		КонецЕсли;			
	Иначе 	
		Предупреждение("Поле 'Год зачисления' пустое");	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ГодЗачисленияПриИзменении(Элемент)
	ЗаполинтьНомерГруппы(); 
	ЗаполнитьНаименование();
КонецПроцедуры

Процедура ЗаполнитьНаименование() 
	Если ЗначениеЗаполнено(НаименованиеГруппы) И ЗначениеЗаполнено(НомерГруппы) И ЗначениеЗаполнено(ГодЗачисления) Тогда 
		Наименование = НаименованиеГруппы+ "-" + НомерГруппы + " "+ ГодЗачисления;	                                                                          	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерГруппыПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеГруппыПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры
