
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РезультатТестирования
	Движения.РезультатТестирования.Записывать = Истина;
	Движение = Движения.РезультатТестирования.Добавить();
	Движение.Период = Дата;
	Движение.Студент = Студент;
	Движение.Тема = Тема;
	Движение.Группа = Группа;
	Движение.РезультатТестирования = РезультатТестирования;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
