
&НаСервере
Процедура  СписокПослеУдаленияНаСервере(НаименованиеГруппыНаУдаление) 
		Попытка
			ГруппаНаУдаление = Справочники.Группы.НайтиПоНаименованию(НаименованиеГруппыНаУдаление, Истина).ПолучитьОбъект();
			ГруппаНаУдаление.Удалить();
		Исключение
			Сообщить("Данная группа не найдена в справочнике 'Группы'");	
		КонецПопытки;
КонецПроцедуры 

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Если Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		ВопросДиалог = Вопрос("Удалить " + Элемент.ТекущиеДанные.Наименование + " из справочника 'Группы'?",РежимДиалогаВопрос.ДаНетОтмена) ;
		Если ВопросДиалог = КодВозвратаДиалога.Да тогда 
			СписокПослеУдаленияНаСервере(Элемент.ТекущиеДанные.Наименование); 
		ИначеЕсли ВопросДиалог = КодВозвратаДиалога.Нет тогда
			Возврат;	
		ИначеЕсли ВопросДиалог = КодВозвратаДиалога.Отмена тогда 
			Отказ = истина;	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры


