//Группы
Процедура ЭкспортГруппCSVНаСервере(ПутьККаталогу)	 Экспорт
	ДатаФайла   = Формат(ТекущаяДата(),"ДФ=dd-MM-yy");  
	ВремяФайла =СтрЗаменить(Формат(ТекущаяДата(),"ДЛФ=T"),":","."); 
	
	НазваниеФайлаГрупп = ПутьККаталогу +"\" + "Группы_" + ДатаФайла + "_" + ВремяФайла  + ".csv";
	ФайлГрупп = Новый ЗаписьТекста;  
	ФайлГрупп.Открыть(НазваниеФайлаГрупп,КодировкаТекста.ANSI);
	
	ФайлГрупп.ЗаписатьСтроку("Наименование");  
	
	Студенты = Справочники.Студенты.Выбрать();
	Пока Студенты.Следующий() Цикл
		Если Студенты.ЭтоГруппа = Истина тогда
			Наименование = Студенты.Наименование; 
			ИнфГруппы = "" +  Наименование;
			ФайлГрупп.ЗаписатьСтроку(ИнфГруппы);
		КонецЕсли;	
	КонецЦикла;
	ФайлГрупп.Закрыть();

КонецПроцедуры
//Студенты
&НаСервере
Процедура ЭкспортСтудентовCSVНаСервере(ПутьККаталогу)	 Экспорт
	ДатаФайла   = Формат(ТекущаяДата(),"ДФ=dd-MM-yy");  
	ВремяФайла =СтрЗаменить(Формат(ТекущаяДата(),"ДЛФ=T"),":","."); 
		
	НазваниеФайлаГрупп = ПутьККаталогу +"\" + "Группы_" + ДатаФайла + "_" + ВремяФайла  + ".csv";	
	НазваниеФайлаСтудентов = ПутьККаталогу +"\" + "Студенты_" + ДатаФайла + "_" + ВремяФайла  + ".csv";
	
		
	ФайлСтудентов = Новый ЗаписьТекста;  
	ФайлСтудентов.Открыть(НазваниеФайлаСтудентов,КодировкаТекста.ANSI);
	
	ФайлСтудентов.ЗаписатьСтроку("Фамилия;Имя; Группа");  
	
	Студенты = Справочники.Студенты.Выбрать();
	Пока Студенты.Следующий() Цикл
		Если Студенты.ЭтоГруппа = Ложь тогда
			Имя 		      = Студенты.Имя; 
			Фамилия 	      = Студенты.Фамилия;
			Родитель	      = Студенты.Родитель;
			ИнфСтудента  = "" + Фамилия + ";"  + Имя + ";"  + Родитель;
			ФайлСтудентов.ЗаписатьСтроку(ИнфСтудента);
		КонецЕсли;	
	КонецЦикла;
	ФайлСтудентов.Закрыть(); 
КонецПроцедуры  

//ДокументТестирование
&НаСервере
Процедура ЭкспортТестированиеCSVНаСервере(ПутьККаталогу) Экспорт
	ДатаФайла   = Формат(ТекущаяДата(),"ДФ=dd-MM-yy");  
	ВремяФайла =СтрЗаменить(Формат(ТекущаяДата(),"ДЛФ=T"),":","."); 
		
	НазваниеФайла = ПутьККаталогу +"\" + "Тестирование_" + ДатаФайла + "_" + ВремяФайла  + ".csv";
	
	Файл = Новый ЗаписьТекста;  
	Файл.Открыть(НазваниеФайла,КодировкаТекста.ANSI);
	
	Файл.ЗаписатьСтроку("Студент;Группа;Тема;Результат тестирования;Дата;Проведен");
	
	Выборка = Документы.Тестирование.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Студент 	= Выборка.Студент;
		Группа     	= Выборка.Группа;
		Тема       	= Выборка.Тема;
		Результат 	= Выборка.РезультатТестирования;
		Дата       	= Выборка.Дата;
		Проведен 	= Выборка.Проведен;
		
		Файл.ЗаписатьСтроку(""+Студент + ";" + Группа + ";" + Тема + ";" + Результат + ";" +  Дата + ";" + Проведен);
	КонецЦикла; 
	Файл.Закрыть();
КонецПроцедуры

//Темы
&НаСервере
Процедура  ЭкспортТемCSVНаСервере(ПутьККаталогу)  Экспорт
	ДатаФайла   = Формат(ТекущаяДата(),"ДФ=dd-MM-yy");  
	ВремяФайла =СтрЗаменить(Формат(ТекущаяДата(),"ДЛФ=T"),":","."); 
		
	НазваниеФайла = ПутьККаталогу +"\" + "Темы_" + ДатаФайла + "_" + ВремяФайла  + ".csv";

	
	ТекстДок = Новый ЗаписьТекста(НазваниеФайла, КодировкаТекста.ANSI);
	ТекстДок.ЗаписатьСтроку("Тема");
	
	Выборока = Справочники.Темы.Выбрать();
	
	Пока Выборока.Следующий()  Цикл	
		ТекстДок.ЗаписатьСтроку(Выборока.Наименование);	
	КонецЦикла;
	
	ТекстДок.Закрыть();
	
КонецПроцедуры
