&НаКлиенте
Процедура ПолучитьФИ()
	Имя     = Элементы.Имя.ТекстРедактирования;
	Фамилия = Элементы.Фамилия.ТекстРедактирования;
	Если НЕ Имя = "" тогда
		Если НЕ Фамилия = "" тогда
			ПерБкИмени = Лев(Имя,1);		
			Объект.Наименование = ПерБкИмени + ". " + Фамилия; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ПолучитьФИ();
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ПолучитьФИ();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
КонецПроцедуры
